/*
Note for the Localization Engineer:
The strings enclosed within < > should NOT be localized. Eg : <OPERATION>
*/

/* Recovery options for the errors */
TryAgainButtonTitle = "Try Again";
CancelButtonTitle = "Cancel";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION> because the following file is corrupted: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION> because the following file cannot be found: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "Replace the “HPEventStore.hpstore” file if you have moved or deleted it and then click “Try Again”. Or, to create a new file, click “Create”.";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "Create";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION> because the application cannot access the following file: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "Repair Access";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "Check the enclosing folders of “HPEventStore.hpstore” to make sure they are not locked and their permissions are set to “Read & Write” and then click “Try Again”. Or, to have the application attempt to repair permissions, click “Repair Access”.";

//Error description for out of disk space error
DiskFullErrorDescription = "<OPERATION> because there is not enough space in the disk.";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "Remove some files from the volume, and then click “Try Again”.";
